In [1]:
import pandas as pd
import numpy as np

In [2]:
names1880 = pd.read_csv('E:/datasets/babynames/yob1880.txt',names=['name','sex','births'])

In [3]:
names1880[:5]

        name sex  births
0       Mary   F    7065
1       Anna   F    2604
2       Emma   F    2003
3  Elizabeth   F    1939
4     Minnie   F    1746

In [4]:
names1880.groupby('sex').births.sum()

sex
F     90993
M    110493
Name: births, dtype: int64

In [5]:
years = range(1880,2011)

In [6]:
pieces=[]
colums=['name','sex','births']

In [7]:
for year in years:
    path = 'E:/datasets/babynames/yob%d.txt' % year
    frame = pd.read_csv(path,names=colums)
    frame['year']=year
    pieces.append(frame)

In [8]:
names = pd.concat(pieces, ignore_index=True)
##將所有資料和併成單一dataframe

In [9]:
names[:10]

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880
5   Margaret   F    1578  1880
6        Ida   F    1472  1880
7      Alice   F    1414  1880
8     Bertha   F    1320  1880
9      Sarah   F    1288  1880

In [10]:
total = names.pivot_table('births', index='year',columns='sex',aggfunc=sum)

In [11]:
total.tail()

sex         F        M
year
2006  1896468  2050234
2007  1916888  2069242
2008  1883645  2032310
2009  1827643  1973359
2010  1759010  1898382

In [12]:
total.plot(title='fkuuu')

In [13]:
 %matplotlib

Using matplotlib backend: Qt5Agg

In [14]:
def abc (ax):
    ax['prop']= ax.births/ax.births.sum()
    return ax

In [15]:
names = names.groupby(['year','sex']).apply(abc)

In [16]:
names

              name sex  births  year      prop
0             Mary   F    7065  1880  0.077643
1             Anna   F    2604  1880  0.028618
2             Emma   F    2003  1880  0.022013
3        Elizabeth   F    1939  1880  0.021309
4           Minnie   F    1746  1880  0.019188
...            ...  ..     ...   ...       ...
1690779    Zymaire   M       5  2010  0.000003
1690780     Zyonne   M       5  2010  0.000003
1690781  Zyquarius   M       5  2010  0.000003
1690782      Zyran   M       5  2010  0.000003
1690783      Zzyzx   M       5  2010  0.000003

[1690784 rows x 5 columns]

In [17]:
names.groupby(['year','sex']).prop.sum()

year  sex
1880  F      1.0
      M      1.0
1881  F      1.0
      M      1.0
1882  F      1.0
            ...
2008  M      1.0
2009  F      1.0
      M      1.0
2010  F      1.0
      M      1.0
Name: prop, Length: 262, dtype: float64

In [18]:
def top_100(ax):
    return ax.sort_values(by='births', ascending=False)[:1000]
grouped = names.groupby(['year','sex'])
top1000 = grouped.apply(top_100)
top1000.reset_index(inplace=True,drop=True)

In [19]:
top1000[:10]

        name sex  births  year      prop
0       Mary   F    7065  1880  0.077643
1       Anna   F    2604  1880  0.028618
2       Emma   F    2003  1880  0.022013
3  Elizabeth   F    1939  1880  0.021309
4     Minnie   F    1746  1880  0.019188
5   Margaret   F    1578  1880  0.017342
6        Ida   F    1472  1880  0.016177
7      Alice   F    1414  1880  0.015540
8     Bertha   F    1320  1880  0.014507
9      Sarah   F    1288  1880  0.014155

In [20]:
boys = top1000[top1000['sex']=='M']

In [21]:
girls = top1000[top1000.sex =='F']

In [22]:
tota_births = top1000.pivot_table('births', index='year',columns='name',aggfunc='sum')

In [23]:
tota_births.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 131 entries, 1880 to 2010
Columns: 6868 entries, Aaden to Zuri
dtypes: float64(6868)
memory usage: 6.9 MB

In [24]:
subset = tota_births[['John','Harry','Mary','Marilyn']]

In [25]:
subset.plot(subplots=True,figsize=(12,10),grid=False,title='happy')

array([<matplotlib.axes._subplots.AxesSubplot object at 0x0000027967699748>,
       <matplotlib.axes._subplots.AxesSubplot object at 0x00000279676B4C88>,
       <matplotlib.axes._subplots.AxesSubplot object at 0x000002796755F308>,
       <matplotlib.axes._subplots.AxesSubplot object at 0x000002796923F2C8>],
      dtype=object)

In [26]:
table =top1000.pivot_table('prop',index='year',columns='sex',aggfunc=sum)

In [27]:
table[:10]

sex          F         M
year
1880  1.000000  0.997375
1881  1.000000  1.000000
1882  0.998702  0.995646
1883  0.997596  0.998566
1884  0.993156  0.994539
1885  0.992251  0.995501
1886  0.989504  0.995035
1887  0.988279  0.996697
1888  0.984241  0.992429
1889  0.984061  0.994981

In [28]:
table.plot(title='happy',yticks=np.linspace(0,1.2,13), xticks=range(1880,2020,20))

In [29]:
df =boys[boys.year == 2010]

In [30]:
df

           name sex  births  year      prop
260877    Jacob   M   21875  2010  0.011523
260878    Ethan   M   17866  2010  0.009411
260879  Michael   M   17133  2010  0.009025
260880   Jayden   M   17030  2010  0.008971
260881  William   M   16870  2010  0.008887
...         ...  ..     ...   ...       ...
261872   Camilo   M     194  2010  0.000102
261873   Destin   M     194  2010  0.000102
261874   Jaquan   M     194  2010  0.000102
261875   Jaydan   M     194  2010  0.000102
261876   Maxton   M     193  2010  0.000102

[1000 rows x 5 columns]

In [31]:
prop_cumsum =df.sort_values(by="prop", ascending=False).prop.cumsum()

In [32]:
prop_cumsum[:10]

260877    0.011523
260878    0.020934
260879    0.029959
260880    0.038930
260881    0.047817
260882    0.056579
260883    0.065155
260884    0.073414
260885    0.081528
260886    0.089621
Name: prop, dtype: float64

In [33]:
prop_cumsum.values.searchsorted(0.5)

116

In [34]:
df = boys[boys.year ==1900]

In [35]:
in1900 =df.sort_values(by='prop',ascending=False).prop.cumsum()

In [36]:
in1900.values.searchsorted(0.5)+1

25

In [37]:
def upup(group,q=0.5):
    group = group.sort_values(by='prop',ascending=False)
    return group.prop.cumsum().values.searchsorted(q)+1

In [38]:
diver =top1000.groupby(['year','sex']).apply(upup)

In [39]:
diver=diver.unstack('sex')

In [40]:
diver.head()

sex    F   M
year
1880  38  14
1881  38  14
1882  38  15
1883  39  15
1884  39  16

In [41]:
diver.plot(title="fkuuu")

In [44]:
get_last = lambda x:x[-1]
last = names.name.map(get_last)
last.name='last_name'

In [46]:
table = names.pivot_table('births', index=last,columns=['sex','year'],aggfunc=sum)

In [47]:
sutable = table.reindex(columns=[1910,1960,2010],level='year')

In [48]:
sutable.head()

sex               F                            M
year           1910      1960      2010     1910      1960      2010
last_name
a          108376.0  691247.0  670605.0    977.0    5204.0   28438.0
b               NaN     694.0     450.0    411.0    3912.0   38859.0
c               5.0      49.0     946.0    482.0   15476.0   23125.0
d            6750.0    3729.0    2607.0  22111.0  262112.0   44398.0
e          133569.0  435013.0  313833.0  28655.0  178823.0  129012.0

In [49]:
sutable.sum()

sex  year
F    1910     396416.0
     1960    2022062.0
     2010    1759010.0
M    1910     194198.0
     1960    2132588.0
     2010    1898382.0
dtype: float64

In [50]:
letter_pop =sutable / sutable.sum()

In [51]:
letter_pop

sex               F                             M
year           1910      1960      2010      1910      1960      2010
last_name
a          0.273390  0.341853  0.381240  0.005031  0.002440  0.014980
b               NaN  0.000343  0.000256  0.002116  0.001834  0.020470
c          0.000013  0.000024  0.000538  0.002482  0.007257  0.012181
d          0.017028  0.001844  0.001482  0.113858  0.122908  0.023387
e          0.336941  0.215133  0.178415  0.147556  0.083853  0.067959
f               NaN  0.000010  0.000055  0.000783  0.004325  0.001188
g          0.000144  0.000157  0.000374  0.002250  0.009488  0.001404
h          0.051529  0.036224  0.075852  0.045562  0.037907  0.051670
i          0.001526  0.039965  0.031734  0.000844  0.000603  0.022628
j               NaN       NaN  0.000090       NaN       NaN  0.000769
k          0.000121  0.000156  0.000356  0.036581  0.049384  0.018541
l          0.043189  0.033867  0.026356  0.065016  0.104904  0.070367
m          0.001201  0.008613  0.002588  0.058044  0.033827  0.024657
n          0.079240  0.130687  0.140210  0.143415  0.152522  0.362771
o          0.001660  0.002439  0.001243  0.017065  0.012829  0.042681
p          0.000018  0.000023  0.000020  0.003172  0.005675  0.001269
q               NaN       NaN  0.000030       NaN       NaN  0.000180
r          0.013390  0.006764  0.018025  0.064481  0.031034  0.087477
s          0.039042  0.012764  0.013332  0.130815  0.102730  0.065145
t          0.027438  0.015201  0.007830  0.072879  0.065655  0.022861
u          0.000684  0.000574  0.000417  0.000124  0.000057  0.001221
v               NaN  0.000060  0.000117  0.000113  0.000037  0.001434
w          0.000020  0.000031  0.001182  0.006329  0.007711  0.016148
x          0.000015  0.000037  0.000727  0.003965  0.001851  0.008614
y          0.110972  0.152569  0.116828  0.077349  0.160987  0.058168
z          0.002439  0.000659  0.000704  0.000170  0.000184  0.001831

In [56]:
import matplotlib.pyplot as plt
fig,axes = plt.subplots(2,1,figsize=(10,8))
letter_pop['M'].plot(kind='bar', rot=0,ax=axes[0], title='Man')
letter_pop['F'].plot(kind='bar', rot=0,ax=axes[1], title='womaa',legend=False)

In [55]:
%matplotlib

Using matplotlib backend: Qt5Agg

In [57]:
letter_pop = table/table.sum()

In [59]:
dny_ts = letter_pop.loc[['d','n','y'],'M'].T

In [61]:
dny_ts.head()

last_name         d         n         y
year
1880       0.083055  0.153213  0.075760
1881       0.083247  0.153214  0.077451
1882       0.085340  0.149560  0.077537
1883       0.084066  0.151646  0.079144
1884       0.086120  0.149915  0.080405

In [62]:
dny_ts.plot()

In [64]:
all_name =pd.Series(top1000.name.unique())

In [65]:
les_like = all_name[all_name.str.lower().str.contains('lesl')]

In [66]:
les_like

632     Leslie
2294    Lesley
4262    Leslee
4728     Lesli
6103     Lesly
dtype: object

In [75]:
filtered = top1000[top1000.name.isin(les_like)]

In [76]:
filtered.groupby('name').births.sum()

name
Leslee      1082
Lesley     35022
Lesli        929
Leslie    370429
Lesly      10067
Name: births, dtype: int64

In [77]:
filtered

          name sex  births  year      prop
632     Leslie   F       8  1880  0.000088
1108    Leslie   M      79  1880  0.000715
2462    Leslie   F      11  1881  0.000120
3014    Leslie   M      92  1881  0.000913
4512    Leslie   F       9  1882  0.000083
...        ...  ..     ...   ...       ...
256327   Lesly   F     699  2008  0.000371
258036  Leslie   F    1975  2009  0.001081
258378   Lesly   F     598  2009  0.000327
260073  Leslie   F    1558  2010  0.000886
260456   Lesly   F     502  2010  0.000285

[400 rows x 5 columns]

In [81]:
table=filtered.pivot_table('births',index='year',columns='sex',aggfunc='sum')

In [82]:
table.tail()

sex        F   M
year
2006  4166.0 NaN
2007  3805.0 NaN
2008  3022.0 NaN
2009  2573.0 NaN
2010  2060.0 NaN

In [86]:
table.plot()

ModuleNotFoundError: No module named 'matplotlib.plot'